<template>
    <el-container 
        class="result"
        >
        <el-aside>
            <el-image style="width: 350px; height: 350px;" :src="attri.imgsrc" :fit="fill"/>
        </el-aside>
        <el-main>
            <div class="content">
            <p id="name">{{attri.name}}</p>
            <p id="label">{{attri.label}}</p>
            </div>
        </el-main>
    </el-container>
    <el-container class="context" v-if="attri.label == 'ISTJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
            1. 严肃、安静、藉由集中心 志与全力投入、及可被信赖获致成功。
            <br/>
            2. 行事务实、有序、实际 、 逻辑、真实及可信赖
            <br/>
            3. 十分留意且乐于任何事（工作、居家、生活）均有良好组织及有序。
            <br/>
            4. 负责任。
            <br/>
            5. 照设定成效来作出决策且不畏阻挠与闲言会坚定为之。
            <br/>
            6. 重视传统与忠诚。
            <br/>
            7. 传统性的思考者或经理。
            <h1>
                领导模式：
            </h1>
            以事实和经验做决定 建立可靠、稳定、持续的工作绩效 尊重传统和等级制度 奖励遵循规则完成任务的员工 关注组织的即时性和实际性需要 倾向性顺序：①感觉 ②思维 ③情感 ④直觉
            <h1>
                解决问题模式：
            </h1>
喜欢完全依据事实在逻辑框架里进行分析，为获得理 
想结果，需考虑对人们的影响，然后寻找更多的可能性和其它含义。 

            <h1>
                工作环境倾向性：
            </h1>
①喜欢与现实、工作努力、关注事实和结果的人共事 
②能长期提供安全性的环境 
③ 奖励稳步发展和按期完成任务的环境
④使用系统性工作方法的环境 
⑤任务型定向和鼓励坚定意志的环境 
⑥提供安静、整齐设施的环境 
⑦环境中允许有不被打扰工作的个人空间 
            <h1>
                潜在的缺点：
            </h1>
                ①因受惠于日常工作而忽视具有长远意义的目标 
②可能忽视人际交往的细节 
③工作方法刻板、不灵活，对变革较少开放态度 
④期望他人和自己一样，同样注意细节和服从管理程序 
            <h1>
                发展建议：
            </h1>
            ①除了关注现实问题，需关注更深远的、定向于未来的问题 
②需考虑人的因素，向他人表达其应得的赞赏 
③为避免陈规，尝试寻找新的选择 
④需培养耐心，应付那些需要用不同方式沟通或忽视规则和程 序的人 
适合领域：工商业领域、政府机构 金融银行业、政府机构 技术领域 医务领域 
适合职业：审计师、会计、财务经理、办公室行政管理、后勤和供应管理、中层经理、公务（法律、税务）执行人员等银行信贷员、成本估价师、保险精算师、税务经纪人、税务检查员等；机械、电气工程师、计算机程序员、数据库管理员、地质、气象学家、法律研究者、律师等；外科医生、药剂师、实验室技术人员、牙科医生、医学研究员等 

        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ISFJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.安静、和善、负责任且有良心。
<br/>
2.行事尽责投入。
<br/>
3.安定性高，常居项目工作或团体之安定力量。
<br/>
4.愿投入、吃苦及力求精确。
<br/>
5.兴趣通常不在于科技方面。对细节事务有耐心。
<br/>
6.忠诚、考虑周到、知性且会关切他人感受。
<br/>
7.致力于创构有序及和谐的工作与家庭环境。
            <h1>
                领导模式：
            </h1>
            ①开始可能不愿担任领导，但当需要承担领导任务时会接受 
②希望自己和他人服从组织的需要 
③以个人的影响力作为后盾 
④认真遵守传统程序和规则 
⑤观察细节以获得现实的结果 
            <h1>
                解决问题模式：
            </h1>
喜欢完全依据事实，尤其是当应用于人和准则方面时为获得理想结果，需退一 
步思考问题的逻辑，然后寻找更多的可能性和其它含义 

            <h1>
                工作环境倾向性：
            </h1>
①喜欢与认真、从事组织性任务的人共事 
②能提供安全性和预测性的工作环境 
③组织结构明晰的环境 
④能保持安静、有一些个人空间的环境 
⑤做事坚持到底的环境 
⑥充满个人化、友好、体谅氛围的环境 
⑦服务型定向的环境 
            <h1>
                潜在的缺点：
            </h1>
①过于谨慎小心，尤其是对待未来发展 
②向他人表明自己观点时，显得意志不太坚定 
③因安静、忘却自我的特性而低估自己 
④过度依赖自己的经验，不能根据环境和其它需要灵活调整 
            <h1>
                发展建议：
            </h1>
①工作中需要估计风险，以积极、全面的观点看待未来 
②需发展更多的自信和直率 
③学会宣扬自己的成就 
④对其它形式的做事方式需保持开放态度 
适合领域：无明显领域特征 医护领域 消费类商业、服务业领域 
适合职业：行政管理人员、总经理助理、秘书、人事管理者、项目经理、物流经理、律师助手等；外科医生及其它各类医生、家庭医生、牙科医生、护士、药剂师、医学专家、营养学专家、顾问等；零售店、精品店业主、大型商场、酒店管理人员、室内设计师等。 

        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'INFJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.具强大动力与本意来达成目的与创意—固执顽固者。
<br/>
2.有宏大的愿景且能快速在众多外界事件中找出有意义的模范。
<br/>
3.对所承负职务，具良好能力于策划工作并完成。
<br/>
4.具怀疑心、挑剔性、独立性、果决，对专业水准及绩效要求高。 
            <h1>
                领导模式：
            </h1>
①促使自己和他人完成组织目标 
②坚定有力地贯彻执行组织的理念 
③要求自己和他人具有顽强意志 
④构思、创造新的模型 
⑤必要时，意志坚定地重建整个组织系统 
            <h1>
                解决问题模式：
            </h1>
①喜欢以其内在的认识制定战略、系统和结构，然后客观地做出决定 
②为获得最佳结果，会接纳他人和那些使自己的认识更加接近现实的细节资料 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢工作中有果断、理智接受挑战、致力于完成远期理念的人 
②工作环境允许思考的独立性和个体性 ③强调效率的环境 
④环境里有具有竞争力和创造性的人 
⑤鼓励和支持自主性的环境 
⑥提供创造机会的环境 
⑦任务定向型和重视详尽思考的环境 
            <h1>
                潜在的缺点：
            </h1>
①可能显得强硬，他人不敢接近 
②长时间不告诉他人自己的想法，因为认为他人也和自己一样认同自己的想法 
③可能很难实际操作理想化的想法 
④过度关注任务而忽视他人的贡献 
            <h1>
                发展建议：
            </h1>
①自己的个性化方式和想法可以征求他人的反馈和建议 
②与参与任务的人早一些沟通和讨论自己的想法和战略计划 
③当事实资料不支持自己的想法时，应面对现实
④明确他人的贡献应受到鼓励和承认的 
适合领域：科研、科技应用 技术咨询、管理咨询 金融、投资领域 创造性行业 
适合职业：各类科学家、研究所研究人员、设计工程师、系统分析员、计算机程序师、研究开发部经理等 各类技术顾问、技术专家、企业管理顾问、投资专家、法律顾问、医学专家、精神分析学家等 经济学家、投资银行研究员、证券投资和金融分析员、投资银行家、财务计划人、企业并购专家等；各类发明家、建筑师、社论作家、设计师、艺术家等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'INTJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.冷静旁观者—安静、预留余地、弹性及会以无偏见的好奇心与未预期原始的幽默观察与分析。
<br/>
2.有兴趣于探索原因及效果，技术事件是为何及如何运作且使用逻辑的原理组构事实、重视效能。
<br/>
3.擅长于掌握问题核心及找出解决方式。
<br/>
4.分析成事的缘由且能实时由大量资料中找出实际问题的核心。
            <h1>
                领导模式：
            </h1>
①以身作则 
②一视同仁，尊重每个人的价值 
③面临麻烦时，采用最有利的方法做出快速反应 
④宽松管理员工，喜欢最少监督自己 
⑤采用明晰、理性的管理原则 
            <h1>
                解决问题模式：
            </h1>
①喜欢依据具体事实以自身具有的内部逻辑构建问题 和解决问题 
②为获得理想结果，需要考虑其它可能性和对人们的影响 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与行为定向、关注即时情境的人共事 
②计划定向和任务定向的环境 
③重视理性分析的环境 
④奖励对问题做出快速反应的环境 
⑤允许间接经验的环境 
⑥提供合适的工作自由度的环境 
⑦培养独立性和自主性的环境 
            <h1>
                潜在的缺点：
            </h1>
①只关注对自身重要的事而对其它事漠不关心 
②在先前的努力获得成果前，缺少坚持性 
③努力不足，过度注重有利性而走捷径 
④犹豫不决，欠缺兴趣、活力、坚持性 
            <h1>
                发展建议：
            </h1>
①需要增强开放性，关心他人，与他人共享信息 
②需发展坚持性，改变沟通模式 
③加强计划性，付出更多努力获取想要的成功 
④需发展设置和保持目标的方法 
适合领域：技术领域 证券、金融业 贸易、商业领域 户外、运动、艺术等领域 
适合职业：机械、电气、电子工程师、各类技术专家和技师、计算机硬件、系统集成专业人员等；证券分析师、金融、财务顾问、经济学研究者等；贸易商、商品经销商、产品代理商（有形产品为主）等；警察、侦探、体育工作者、赛车手、飞行员、雕塑家、手工制作、画家等。
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ISTP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.羞怯的、安宁和善地、敏感的、亲切的、且行事谦虚。
<br/>
2.喜于避开争论，不对他人强加已见或价值观。
<br/>
3.无意于领导却常是忠诚的追随者。
<br/>
4.办事不急躁，安于现状无意于以过度的急切或努力破坏现况，且非成果导向。
<br/>
5.喜欢有自有的空间及照自订的时程办事。
            <h1>
                领导模式：
            </h1>
①不喜欢担任领导，喜欢在团队中担任协调者的角色 
②用自己个人的忠诚激发他人工作的积极性 
③常常更多地采用表扬和支持的方式，较少批评他人 
④随环境所需而做调适 
⑤通过了解他人良好的意图温和地说服他人 
            <h1>
                解决问题模式：
            </h1>
①喜欢从实用的角度考虑对自己和他人真正重要的事物 
②为获得理想结果，需考虑其他人际关系和其它可能性， 然后更客观地决定事情 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与合作的、安静地享受工作愉悦感的人共事 
②允许有个人空间的工作环境 
③与致力于和谐相处的人共事 
④能提供灵活性和安全感的环境 
⑤有艺术感染力的环境 
⑥讲究礼貌的同事 
⑦追求实际效果的环境 
            <h1>
                潜在的缺点：
            </h1>
①可能太信任他人，不愿持怀疑态度 
②为避免冲突而不批评他人 
③只关注眼前的损失 
④过度自我批评，容易受伤害 
            <h1>
                发展建议：
            </h1>
①需发展以怀疑的态度分析他人提供的信息 
②需学会给他人负面反馈，处理好冲突 
③需发展更广阔、更朝向未来定向的观念 
④需对他人更果断，对自己有更多赞赏 
适合领域：手工艺、艺术领域 医护领域 商业、服务业领域 
适合职业：时装、首饰设计师、装潢、园艺设计师、陶器、乐器、卡通、漫画制作者、素描画家、舞蹈演员、画家等；出诊医生、出诊护士、理疗师、牙科医生、个人健康和运动教练等；餐饮业、娱乐业业主、旅行社销售人员、体育用品、个人理疗用品销售员等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ISFP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1安静观察者，具理想性与对其价值观及重要之人具忠诚心。
<br/>
2.希外在生活形态与内在价值观相吻合。
<br/>
3.具好奇心且很快能看出机会所在。常担负开发创意的触媒者　。
<br/>
4.除非价值观受侵犯，行事会具弹性、适应力高且承受力强。
<br/>
5.具想了解及发展他人潜能的企图。想作太多且作事全神贯注　。
<br/>
6.对所处境遇及拥有不太在意。
<br/>
7.具适应力、有弹性除非价值观受到威胁。 
            <h1>
                领导模式：
            </h1>
①采用便利的领导方式 
②倾向发挥独特的领导能力而不是担当传统性的领导角色 
③独立工作 
④更可能表扬而不是批评他人 
⑤鼓励员工以行动实现理想 
            <h1>
                解决问题模式：
            </h1>
①思考真正对他人和自己重要的问题，找出具有创造性的可能性 
②为获得最佳结果注意搜集事实资料客观地做出决策 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢处在有重要价值观、令人愉悦、效忠组织的人们中 
②处在合作、轻松氛围的环境里 
③允许个体性，也提供共同参与的环境 
④环境中提供灵活、有弹性的工作程序，最少的常规 
⑤非官僚主义的环境 
⑥安静的环境 
⑦有时间和空间进行思考的工作环境 
            <h1>
                潜在的缺点：
            </h1>
①因完美倾向而延误完成任务 
②一次行为想令太多人满意 
③没有调整理想适合客观现实 
④思考多于行动 
            <h1>
                发展建议：
            </h1>
①需要学会怎样工作而不是只注意寻求理想的反应 
②需要发展更坚强的意志，并愿意说“不” 
③需要用自己的准则分清事实和逻辑 
④需要建立和执行行动计划 
适合领域：创作性、艺术类 教育、研究、咨询类 
适合职业：各类艺术家、插图画家、诗人、小说家、建筑师、设计师、文学编辑、艺术指导、记者等；大学老师（人文类）、心理学工作者、心理辅导和咨询人员、社科类研究人员、社会工作者、教育顾问、图书管理者、翻译家等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'INFP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.安静、自持、弹性及具适应力。
<br/>
2.特别喜爱追求理论与科学事理。
<br/>
3.习于以逻辑及分析来解决问题—问题解决者。
<br/>
4.最有兴趣于创意事务及特定工作，对聚会与闲聊无大兴趣。
<br/>
5.追求可发挥个人强烈兴趣的生涯。
<br/>
6.追求发展对有兴趣事务之逻辑解释。
            <h1>
                领导模式：
            </h1>
①在概念上分析问题和目标 
②提供逻辑思维模式 
③追求自主性的同时，也关注他人独立的领导模式 
④依据他人的专业知识而非职位与其交往 
⑤追求与他人智慧上的交流而非情感交流 
            <h1>
                解决问题模式：
            </h1>
①在寻求各种可能的选择时，喜欢以自身内部的逻辑建构问题和解决问题 
②为获取最佳结果，需同时关注现实状况和他人需求 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与独立思考者、关注解决复杂问题的人共事 
②环境中允许个体有充足的时间和空间进行思考 
③能培养思维独立性和创造性的环境 
④能提供灵活的政策和程序的环境 
⑤安静、尽可能少地开会的环境 
⑥非结构化和非官僚作风的环境 
⑦奖励自我决定的环境 
            <h1>
                潜在的缺点：
            </h1>
①过于抽象，因而坚持下去不太符合现实需要 
②过于理性化，解释起来太理论化 
③过多注意团队中一些小的不一致的地方 
④可能以批评式分析方式待人，行动不考虑个体感受 
            <h1>
                发展建议：
            </h1>
①需要关注现实中的细节，确立完成任务的具体步骤 
②需要简单地陈述事实 
③为获得他人的合作，需要放弃细小的问题 
④需要更好地认识他人，更多地表达对他人的赞赏 
适合领域：计算机技术 理论研究、学术领域 专业领域 创造性领域 
适合职业：软件设计员、系统分析师、计算机程序员、数据库管理、故障排除专家等 大学教授、科研机构研究人员、数学家、物理学家、经济学家、考古学家、历史学家等 证券分析师、金融投资顾问、律师、法律顾问、财务专家、侦探等；各类发明家、作家、设计师、音乐家、艺术家、艺术鉴赏家等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'INTP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.擅长现场实时解决问题—解决问题者。
<br/>
2.喜欢办事并乐于其中及过程。
<br/>
3.倾向于喜好技术事务及运动，交结同好友人。
<br/>
4.具适应性、容忍度、务实性；投注心力于会很快具　成效工作。
<br/>
5.不喜欢冗长概念的解释及理论。
<br/>
6.最专精于可操作、处理、分解或组合的真实事务。 
            <h1>
                领导模式：
            </h1>
①对危机中的管理有充分准备 
②说服他人接受自己的观点 
③直率、自信的领导方式 
④按最有利的路径进行组织工作 
⑤重视行动和即时结果 
            <h1>
                解决问题模式：
            </h1>
①喜欢现实、具体地评估环境，然后用逻辑分析以后采 取的步骤 
②为获得理想结果，会考虑对人们的影响，寻找其它可选择的可能性 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与活泼、结果定向型、重视直接经验的人共事 
②有规则，但承认差异性的环境 
③环境中允许有开玩笑的时间 
④能提供工作灵活性的环境 
⑤技术型定向的环境，有最新的设备 
⑥身体感到舒适的环境 
⑦对即刻的需求能做出反应的环境 
            <h1>
                潜在的缺点：
            </h1>
①当快速行为时，显得苛求、强硬、感觉迟钝 
②过分集中于即时行为，而失去行为的更广阔、深远的意义
③转移到下一个待解决问题而不能坚持解决目前的问题 
④会被工作以外的活动吸引，如体育运动和其它娱乐活动。 
            <h1>
                发展建议：
            </h1>
①需抑制自己的任务型定向，分析他人的情绪感受 
②需在快速决定之前，事先计划，考虑更多的因素 
③需完成眼前的任务 
④需以适当的观点看待工作和娱乐 
适合领域：贸易、商业、某些特殊领域 服务业 金融证券业 娱乐、体育、艺术领域 
适合职业：各类贸易商、批发商、中间商、零售商、房地产经纪人、保险经济人、汽车销售人员、私家侦探、警察等； 餐饮、娱乐及其他各类服务业的业主、主管、特许经营者、自由职业者等。 股票经纪人、证券分析师、理财顾问、个人投资者等；娱乐节目主持人、体育节目评论、脱口秀、音乐、舞蹈表演者、健身教练、体育工作者等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ESTP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.外向、和善、接受性、乐于分享喜乐予他人。
<br/>
2.喜欢与他人一起行动且促成事件发生，在学习时亦然。
<br/>
3.知晓事件未来的发展并会热列参与。
<br/>
5.最擅长于人际相处能力及具备完备常识，很有弹性能立即　适应他人与环境。
<br/>
6.对生命、人、物质享受的热爱者。 
            <h1>
                领导模式：
            </h1>
①促进善意和合作的领导方式 
②喜欢从开头管理某个工程 
③消除紧张气氛，把人们带入轻松的情境里 
④关注解决即时出现的问题 
⑤促进人际间有效的交流 
            <h1>
                解决问题模式：
            </h1>
①喜欢对情境进行现实和具体的评估，尤其是对于人更是如此 
②为获得最佳结果，需增强客观性，从长远的眼光看待 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与有活力的、轻松愉快、关注现实的人共事 
②活跃、行为定向的工作环境 
③培养快节奏做事的环境 
④有适应性强、喜爱自由的人的工作环境 
⑤强调和谐、友好、赞赏别人的环境 
⑥乐观的、注重交往的工作环境
⑦有吸引力、丰富多彩的环境 
            <h1>
                潜在的缺点：
            </h1>
①为保持和谐，过度强调主观性论据 
②行动前不太考虑眼前的事实 
③可能花太多的时间在社会关系上而忽视任务本身 
④常常有始无终 
            <h1>
                发展建议：
            </h1>
①为减少非个体性冲突，做决策时需理智分析决策的意义 
②进行管理工作前应事先制定计划 
③需平衡花费在任务和社会性交往上的时间 
④需致力于完成计划，对时间进行管理 
适合领域：消费类商业、服务业领域 广告业、娱乐业领域、旅游业、社区服务等其他领域 
适合职业：精品店、商场销售人员、娱乐、餐饮业客户经理、房地产销售人员、汽车销售人员、市场营销人员（消费类产品）等；广告企业中的设计师、创意人员、客户经理、时装设计和表演人员、摄影师、节目主持人、脱口秀演员等；旅游企业中的销售、服务人员、导游、社区工作人员、自愿工作者、公共关系专家、健身和运动教练、医护人员等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ESFP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.充满热忱、活力充沛、聪明的、富想象力的，视生命充满机会但期能得自他人肯定与支持。
<br/>
2.几乎能达成所有有兴趣的事。
<br/>
3.对难题很快就有对策并能对有困难的人施予援手。
<br/>
4.依赖能改善的能力而无须预作规划准备。
<br/>
5.为达目的常能找出强制自己为之的理由。
            <h1>
                领导模式：
            </h1>
①富有活力、热情的领导方式 
②喜欢进行首创性管理 
③经常是重要事件的发言人 
④工作中提倡和支持人们的自主性 
⑤关注如何激励他人，如何鼓励他人付诸于行动 
            <h1>
                解决问题模式：
            </h1>
①喜欢根据自己的价值观和准则探索创造性发展的各种可能性和前景 
②为获得最佳结果，冷静理智分析，考虑相关的事实资料和各种细节 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与想象力丰富、致力于人们未来发展的人共事 ②允许表现交际能力和智力才能的环境 
③爱好参与的氛围，与不同的人分享不同的观点 
④提供变化和具有挑战性的环境 
⑤鼓励提出观点和想法的环境 
⑥有弹性、自由度大、少限制的环境
            <h1>
                潜在的缺点：
            </h1>
①在没完成已经提出的计划之前又转移到新的想法和计划上 
②忽视相关的细节和事实资料 
③过分扩展，尝试做的事情太多 
④因寻求可能的最佳结果而拖延工作 
            <h1>
                发展建议：
            </h1>
①需要根据重要性事先做好安排，先做最重要的，坚持到底。 
②需要关注重要的细节 
③需要学会筛选任务，不要试图去做所有具有吸引力的任务。 
④为达成目标，需使用制定计划和进行时间管理的技巧 
适合领域：
广告创意、广告撰稿人，市场营销和宣传策划、市场调研人员、艺术指导、公关专家、公司对外发言人等. 
适合职业：
儿童教育老师、大学老师（人文类）、心理学工作者、心理辅导和咨询人员、职业规划顾问、社会工作者、人力资源专家、培训师、演讲家等 记者（访谈类）、节目策划和主持人、专栏作家、剧作家、艺术指导、设计师、卡通制作者、电影、电视制片人等。
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ENFP'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.充满热忱、活力充沛、聪明的、富想象力的，视生命充满机会但期能得自他人肯定与支持。
<br/>
2.几乎能达成所有有兴趣的事。
<br/>
3.对难题很快就有对策并能对有困难的人施予援手。
<br/>
4.依赖能改善的能力而无须预作规划准备。
<br/>
5.为达目的常能找出强制自己为之的理由。
<br/>
6.即兴执行者。 
            <h1>
                领导模式：
            </h1>
①富有活力、热情的领导方式 
②喜欢进行首创性管理 
③经常是重要事件的发言人 
④工作中提倡和支持人们的自主性 
⑤关注如何激励他人，如何鼓励他人付诸于行动 
            <h1>
                解决问题模式：
            </h1>
①喜欢根据自己的价值观和准则探索创造性发展的各种可能性和前景 
②为获得最佳结果，冷静理智分析，考虑相关的事实资料和各种细节
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与想象力丰富、致力于人们未来发展的人共事 ②允许表现交际能力和智力才能的环境 
③爱好参与的氛围，与不同的人分享不同的观点 
④提供变化和具有挑战性的环境 
⑤鼓励提出观点和想法的环境 
⑥有弹性、自由度大、少限制的环境 
⑦气氛愉悦和随意的环境 
            <h1>
                潜在的缺点：
            </h1>
①在没完成已经提出的计划之前又转移到新的想法和计划上 
②忽视相关的细节和事实资料 
③过分扩展，尝试做的事情太多 
④因寻求可能的最佳结果而拖延工作 
            <h1>
                发展建议：
            </h1>
①需要根据重要性事先做好安排，先做最重要的，坚持到底。 
②需要关注重要的细节 
③需要学会筛选任务，不要试图去做所有具有吸引力的任务。 
④为达成目标，需使用制定计划和进行时间管理的技巧 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ENTP'">
        <h2>
            <h1>
                基本特征：
            </h1>
            1.反应快、聪明、长于多样事务。
            <br/>
2.具激励伙伴、敏捷及直言讳专长。
<br/>
3.会为了有趣对问题的两面加予争辩。
<br/>
4.对解决新及挑战性的问题富有策略，但会轻忽或厌烦经常的任务与细节。
<br/>
5.兴趣多元，易倾向于转移至新生的兴趣。
<br/>
6.对所想要的会有技巧地找出逻辑的理由。
<br/>
7.长于看清础他人，有智能去解决新或有挑战的问题 
            <h1>
                领导模式：
            </h1>
①制定理论体系满足组织的需要 
②鼓励他人的独立性 
③运用逻辑分析寻找变革的模式 
④对于自己想做的事使用强制性的理由 
⑤在人与组织之间扮演促进者的角色 
            <h1>
                解决问题模式：
            </h1>
①喜欢探索未来的前景和发展模式，理智地分析每一个正向和反向的结果 
②为获得最理想结果，关注人们的需要和相关的事实和细节 工作环境倾向性:①喜欢与独立的、按理论模型解决复杂问题的人共事 ②提供灵活性和挑战性的工作环境 
③变革型和非官僚作风的工作环境 
④拥有具有竞争力的个体的环境 
⑤奖励挑战风险行为的工作环境 
⑥鼓励行为自主性和自由性的环境 
⑦关注未来发展远景的工作环境
            <h1>
                工作环境倾向性：
            </h1>
①喜欢探索未来的前景和发展模式，理智地分析每一个正向和反向的结果 
②为获得最理想结果，关注人们的需要和相关的事实和细节 工作环境倾向性:①喜欢与独立的、按理论模型解决复杂问题的人共事 ②提供灵活性和挑战性的工作环境 
③变革型和非官僚作风的工作环境 
④拥有具有竞争力的个体的环境 
⑤奖励挑战风险行为的工作环境 
⑥鼓励行为自主性和自由性的环境 
⑦关注未来发展远景的工作环境
            <h1>
                潜在的缺点：
            </h1>
①过多依赖模型而忘记现实状况 ②因竞争心而不会赞赏他人的付出 ③因过分扩展自己而筋疲力尽 ④可能抵制正规的程序和准则 
            <h1>
                发展建议：
            </h1>
①需要注意各个方面的因素和基本的事实 
②需要承认他人贡献的有效性 
③需要设立现实性的开始与结束的期限，知道何时该结束 
④需要学会怎样在组织里如何工作 
适合领域：投资顾问、项目策划、投资银行、自我创业 市场营销、创造性领域 公共关系 政治 
适合职业：投资顾问（房地产、金融、贸易、商业等）、各类项目的策划人和发起者、投资银行家、风险投资人、企业业主（新兴产业）等；市场营销人员、各类产品销售经理、广告创意、艺术总监、访谈类节目主持人、制片人等；公共关系专家、公司对外发言人、社团负责人、政治家等。
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ESTJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
            1.务实、真实、事实倾向，具企业或技术天份。
            <br/>
2.不喜欢抽象理论；最喜欢学习可立即运用事理。
<br/>
3.喜好组织与管理活动且专注以最有效率方式行事以达致成效。
<br/>
4.具决断力、关注细节且很快作出决策—优秀行政者。
<br/>
5.会忽略他人感受。
<br/>
6.喜作领导者或企业主管。 
            <h1>
                领导模式：
            </h1>
①直接领导，快速管理 
②运用过去经验解决问题
③直接、明确地识别问题的核心 
④决策和执行决策非常迅速 
⑤传统型领导，尊重组织内部的等级和组织获得的成就 
            <h1>
                解决问题模式：
            </h1>
①喜欢根据相关的事实和细节进行逻辑分析，从而控 制情境 
②为达到理想结果，会考虑更广阔的前景以及对人们和自己的影响 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与努力工作、有坚定决心把工作做好的人共事 
②任务型定向的环境 
③有组织和组织结构的环境 
④有团队计划的环境 
⑤提供稳定性和预测性的环境 
⑥致力于绩效和生产性的环境 
⑦奖励完成目标的环境 
            <h1>
                潜在的缺点：
            </h1>
①决策太迅速，也给他人施以同样的压力 
②不能察觉变革的需要，因为相信一切都在正常运作 
③在完成任务过程中，忽视人际间的小细节 
④长期忽视自己的感受和准则，可能会被自己的情感击跨 
            <h1>
                发展建议：
            </h1>
①决策之前需考虑各种因素，包括人的因素 
②需要促使自己看到他人要求变革而获得的利益 
③需做特别的努力学会赞赏别人 
④需从工作中抽点时间考虑和识别自己的情感和价值观 
适合领域：无明显领域特征 
适合职业：大、中型外资企业员工、业务经理、中层经理（多分布在财务、营运、物流采购、销售管理、项目管理、工厂管理、人事行政部门）、职业经理人、各类中小型企业主管和业主。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ESFJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.诚挚、爱说话、合作性高、受　欢迎、光明正大 的—天生的　合作者及活跃的组织成员。
<br/>
2.重和谐且长于创造和谐。
<br/>
3.常作对他人有益事务。
<br/>
4.给予鼓励及称许会有更佳工作成效。
<br/>
5.最有兴趣于会直接及有形影响人们生活的事务。
<br/>
6.喜欢与他人共事去精确且准时地完成工作。
            <h1>
                领导模式：
            </h1>
①关心他人的领导方式 

②以良好的人际关系赢得合作 
③让人们活跃起来 
④承担繁重的工作，坚持到底 
⑤发扬组织的传统精神 
            <h1>
                解决问题模式：
            </h1>
①喜欢考虑准则以及对人们的影响，也关注相关的事实和有用的细节 
②为获取理想结果，需识别其它人际关系，然后理智、 冷静地分析 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与诚恳、具有合作性、乐于帮助他人的人共事 
②目标定向型的环境，提供有益、合适的工作程序 
③奖励组织行为和个体工作绩效的环境 
④鼓励人际间的友谊的工作环境 
⑤赞赏他人和开朗的工作氛围 
⑥培养人际间关心和敏感察觉他人需要的工作环境 
⑦关注事实和价值观的环境 
            <h1>
                潜在的缺点：
            </h1>
①避免和回避冲突 
②因致力于令他人满意而忽略自己 
③提供自己认为是对组织和对他人最好的建议 
④不经常有时间客观地反思过去、展想未来 
            <h1>
                发展建议：
            </h1>
①需学会注意差异性和处理冲突 
②需学会分离出自己的需要 
③需学会更客观地听取真正需要什么 
④做决策时，需考虑决策的理性、全局性的意义 
适合领域：无明显领域特征 
适合职业：办公室行政或管理人员、秘书、总经理助理、项目经理、客户服务部人员、采购和物流管理人员等；内科医生及其它各类医生、牙科医生、护士、健康护理指导师、饮食学、营养学专家、小学教师（班主任）、学校管理者等；银行、酒店、大型企业客户服务代表、客户经理、公共关系部主任、商场经理、餐饮业业主和管理人员等。 
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ENFJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.热忱、易感应及负责任的--具能鼓励他人的领导风格。
<br/>
2.对别人所想或希求会表达真正关切且切实用心去处理。
<br/>
3.能怡然且技巧性地带领团体讨论或演示文稿提案。
<br/>
4.爱交际、受欢迎及富同情心。
<br/>
5.对称许及批评很在意。
<br/>
6.喜欢带引别人且能使别人或团体发挥潜能。
            <h1>
                领导模式：
            </h1>
①富于热情和赞扬他人的领导方式 
②以参与的态度管理员工和工作 
③满足员工的需要，努力使每个员工满意 
④促使组织的行为与组织的价值观一致 
⑤鼓励施行给人们带来利益的变革 
            <h1>
                解决问题模式：
            </h1>
①先判断发展计划是否考虑能取得的绩效和对人们的影响 
②为获得最佳结果注意更多事实资料，然后进行理智、冷静地分析 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与那些关注变革并通过变革改变人们的人共事 
②喜欢人际定向型和社会型的环境 
③鼓励支持和称赞他人的环境 
④富有同情精神和和睦气氛的环境 
⑤鼓励自我表现的环境 
⑥稳定而注重果断性的环境 
⑦注重反馈和秩序的环境 
            <h1>
                潜在的缺点：
            </h1>
①可能会理想化他人，因而遭受他人表面忠诚的蒙蔽 
②可能回避有冲突的问题 
③因重视人际关系而忽视任务 
④过度自我批评 
            <h1>
                发展建议：
            </h1>
①需要认识人们的局限性，捍卫真正的忠诚 
②需要学会建设性地处理冲突 
③需要学会同时关注任务中的细节问题和完成任务的人 
④需要认真听取客观的评价，少一些自我批评 
适合领域：培训、咨询、教育 新闻传播、公共关系、文化艺术 
适合职业：人力资源培训主任、销售、沟通、团队培训员、职业指导顾问、心理咨询工作者、大学教师（人文学科类）、教育学、心理学研究人员等 记者、撰稿人、节目主持人（新闻、采访类）、公共关系专家、社会活动家、文艺工作者、平面设计师、画家、音乐家等。
        </h2>
    </el-container>

    <el-container class="context" v-if="attri.label == 'ENTJ'">
        <h2>
            <h1>
                基本特征：
            </h1>
1.坦诚、具决策力的活动领导者。
<br/>
2.长于发展与实施广泛的系统以解决组织的问题。
<br/>
3.专精于具内涵与智能的谈话如对公众演讲。
<br/>
4.乐于经常吸收新知且能广开信息管道。
<br/>
5.易生过度自信，会强于表达自已创见。
<br/>
6.喜于长程策划及目标设定 
            <h1>
                领导模式：
            </h1>
①富于活力的行为定向型领导模式 
②为组织制定长远规划 
③必要时，采用直接的、强硬的管理方式 
④喜欢复杂问题并足智多谋地解决这些问题 
⑤尽可能多地参与组织管理 
            <h1>
                解决问题模式：
            </h1>
①根据内在的理解进行逻辑分析从而控制局面 
②为获得理想结果，对事实资料进行现实性决策，同时考虑决策对人们和自己的 影响 
            <h1>
                工作环境倾向性：
            </h1>
①喜欢与结果定向型、独立的、有能力的、注重解决复杂问题的人共事 
②目标型定向的工作环境 
③有效率的组织系统和员工 
④工作环境中即刻奖励做出挑战努力的员工 
⑤奖励果断的人的环境 
⑥环境中有意志坚定的人 
⑦组织关注主要的组织计划 
            <h1>
                潜在的缺点：
            </h1>
①关注任务而忽视人们的需要和对组织的贡献 
②忽略现实的考虑和对现实局限性的认识 
③决策太迅速，表现得缺乏耐心，盛气凌人 
④忽视和抑制自己和他人的情感 
            <h1>
                发展建议：
            </h1>
①需要考虑人的因素，赞赏他人对组织的贡献 
②行动前先检查现实的、人力的、环境的资源是否可获得 
③决策前花些时间考虑和反思各个方面的因素 
④需要学会鉴别和重视自己和他人的情感 
适合领域： 工商业、政界 金融和投资领域 管理咨询、培训 专业性领域 
适合职业： 各类企业的高级主管、总经理、企业主、社会团体负责人、政治家等 投资银行家、风险投资家、股票经纪人、公司财务经理、财务顾问、经济学家 企业管理顾问、企业战略顾问、项目顾问、专项培训师等；律师、法官、知识产权专家、大学教师、科技专家等。 
        </h2>
    </el-container>
</template>

<script>
import { useRouter, useRoute } from 'vue-router';
import { reactive, getCurrentInstance } from 'vue'

export default({
    setup() {

       // console.log(JSON.parse("{\"ErrCode\":100008, \"ErrMsg\":\"没有记录哟，快去测试吧\"}"))

        const router = useRouter()
        const route = useRoute()
        const {proxy} = getCurrentInstance()

        const goTest=()=> {
            router.push('/test')
        }

        let attri = reactive({
            name: '',
            label: '',
            imgsrc: '',
            bcolor: '',
            name_color: '',
            label_color: ''
        })

        const types = {
            INTJ: '建筑师',
            INTP: '逻辑学家',
            ENTJ: '指挥官',
            ENTP: '辩论家',
            ENFJ: '主人公',
            INFJ: '倡导者',
            INFP: '调停者',
            ENFP: '竞选者',
            ISTJ: '物流师',
            ISFJ: '守卫者',
            ESTJ: '总经理',
            ESFJ: '执政官',
            ISTP: '鉴赏家',
            ISFP: '探险家',
            ESTP: '企业家',
            ESFP: '表演者',
        }

        const colors = {
            analysts: {
                bg: '#E7DFEA',
                name: '#584164',
                label: '#90759F',
            },
            diplomats: {
                bg: '#D6ECE3',
                name: '#35785D',
                label: '#99C26C',
            },
            sentinels: {
                bg: '#D9EAF0',
                name: '#369395',
                label: '#71CACC',
            },
            explorers: {
                bg: '#F9EED7',
                name: '#BE8F00',
                label: '#F4D65D',
            },
        }

        const test = {
            analysts: {
                analysts: ['INTJ', 'INTP', 'ENTJ', 'ENTP'],
                colors: {
                    bg: '#E7DFEA',
                    name: '#584164',
                    label: '#90759F',
                },
            },
        }

        const groups = {
            analysts: ['INTJ', 'INTP', 'ENTJ', 'ENTP'],
            diplomats: ['INFJ', 'INFP', 'ENFJ', 'ENFP'],
            sentinels: ['ISTJ', 'ISFJ', 'ESTJ', 'ESFJ'],
            explorers: ['ISTP', 'ISFP', 'ESTP', 'ESFP'],
        }

        const getGroup=(type)=>{
            let i
            let j
            for (i in groups) {
                for (j=0; j<4; j++) {
                    if (groups[i][j] == type) {
                        return i
                    }
                }
            }
            return
        }


        const getTypeRecord=async()=> {
            const res = await new proxy.$request(proxy.$urls.m().getlatestdata).get()
            let result = res.type
            let group = getGroup(result)
            attri.label = result
            attri.name = types[result]
            attri.imgsrc = require('../assets/' + result + '.png')
            // 结果的界面的颜色
            attri.bcolor = colors[group].bg
            attri.name_color = colors[group].name
            attri.label_color = colors[group].label
            return res
        }

        getTypeRecord()

        // let group = getGroup(result)
        // attri.label = result
        // attri.name = types[result]
        // attri.imgsrc = require('../assets/' + result + '.png')
        // // 结果的界面的颜色
        // let bcolor = colors[group].bg
        // let name_color = colors[group].name
        // let label_color = colors[group].label

        return {
            router,
            attri,
            goTest,
        }
    },
})
</script>
>

<style scoped lang="less">
    .result {
        justify-content: center;
        background-color: v-bind("attri.bcolor");
        height: 100%;
        width: 100%;
        padding-left: 15%;
        padding-right: 15%;
        //padding: 5%;
    }

    .context {
        height: 2300px;
        background-color: v-bind("attri.bcolor");
    }

    .context h1 {
        font-size: 50px;
        font-family: 微软雅黑;
        color:v-bind("attri.name_color");
    }

    .context h2 {
        font-size: 30px;
        font-family: 楷体;
        padding-left: 10%;
    }

    .el-aside {
        width: 50%;
    }

    .contentmenu {
        width: 40%;
        height: 100%;
    }

    .el-image {
        position: relative;
        top: 20%;
        left: 20%;
    }

    .el-main {
        width: 50%;
        height: 100%;
    }

    .content {
        position: relative;
        text-align: center;
        top: 20%;
    }

    #name {
        font-size: 60px;
        color: v-bind("attri.name_color");
        font-family: 幼圆;
        font-weight: bold;  
    }

    #label {
        font-size: 60px;
        color: v-bind("attri.label_color");
        font-family: 华文琥珀;
        font-weight: bold; 
        line-height: 30px
    }

    // .box-card {
    //     background-color: #fff;
    //     position: relative;
    //     top: 10%;
    //     height: 400px;
    //     width: 500px;
    //     border-radius: 40px
    // }
</style>